# -*- coding: utf-8 -*-

"""
    @Author 坦克手贝塔
    @Date 2021/12/7 19:49
"""
"""
请你判断一个 9 x 9 的数独是否有效。只需要 根据以下规则 ，验证已经填入的数字是否有效即可。
数字 1-9 在每一行只能出现一次。
数字 1-9 在每一列只能出现一次。
数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图）
注意：
一个有效的数独（部分已被填充）不一定是可解的。
只需要根据以上规则，验证已经填入的数字是否有效即可。
空白格用 '.' 表示。

输入：board = 
[["5","3",".",".","7",".",".",".","."]
,["6",".",".","1","9","5",".",".","."]
,[".","9","8",".",".",".",".","6","."]
,["8",".",".",".","6",".",".",".","3"]
,["4",".",".","8",".","3",".",".","1"]
,["7",".",".",".","2",".",".",".","6"]
,[".","6",".",".",".",".","2","8","."]
,[".",".",".","4","1","9",".",".","5"]
,[".",".",".",".","8",".",".","7","9"]]
输出：true

输入：board = 
[["8","3",".",".","7",".",".",".","."]
,["6",".",".","1","9","5",".",".","."]
,[".","9","8",".",".",".",".","6","."]
,["8",".",".",".","6",".",".",".","3"]
,["4",".",".","8",".","3",".",".","1"]
,["7",".",".",".","2",".",".",".","6"]
,[".","6",".",".",".",".","2","8","."]
,[".",".",".","4","1","9",".",".","5"]
,[".",".",".",".","8",".",".","7","9"]]
输出：false
解释：除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。 
但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无效的。
"""
"""
思路：直接遍历，看每行每列和每九个格子是否重复
"""


class Solution(object):
    @staticmethod
    def is_valid(board):
        """
        :type board: List[List[str]]
        :rtype: bool
        """
        validation = [[], [], [], [], [], [], [], [], []]
        for i in range(0, 9):
            visited = []
            for j in range(0, 9):
                if board[i][j] != '.':
                    if board[i][j] in visited:
                        return False
                    else:
                        visited.append(board[i][j])
                    if board[i][j] in validation[3*(i//3) + j//3]:
                        return False
                    else:
                        validation[3 * (i//3) + j//3].append(board[i][j])

        for j in range(0, 9):
            visited = []
            for i in range(0, 9):
                if board[i][j] != '.' and board[i][j] in visited:
                    return False
                if board[i][j] != '.' and board[i][j] not in visited:
                    visited.append(board[i][j])

        return True
